const methods = [
     {
          method: "Розрахунок комплексу висувається в заданий район, розгортає за 10-15хв. елементи комплексу, будує маршрут польоту (MissionPlanner), програмує автопілот, перевіряє роботу систем."
     },
     {
          method: "По готовності, БЛА виконує зліт в автоматичному режимі, набирає визначену висоту та переходить до виконання завдання."
     },
     {
          method: "Під час польоту взаданих координатах виконується увімкнення вимкнення камери для фіксації ураження цілі, визначається в автоматичному режимі момент скиду корисного навантаження та спрацьовує система скиду."
     },
     {
          method: "При неможливості виконання завдання, відбувається автоматичний пуск скиду корисного наватнаження (розвантаження) набезпечній відстані від розрахунку."
     },
     {
          method: "Можливий запуск багатьох БПЛА з інтервалом 15-20 хвилин з використанням однієї наземної станції та групи операторів"
     },
     {
          method: "Після виконання завдання БПЛА виконує автоматичну посадку взаданій точці. Оператор БПЛА знімає дані фото та відео запис, виконує технічний огляд БПЛА та підготовку до наступного вильоту."
     }
];

const renderMethods = (methods) => {
     return methods.map((method, index) => {
          return `
          <li class="method-item">
               <div class="method-number-block"><span class="method-number">${index < 10 ? `0${index + 1}` : index + 1}</span></div>
               <p class="method-desc">${method.method}</p>
          </li>`
     }).join('')
}

let methodList = document.querySelector('.methods-list');
methodList.innerHTML = renderMethods(methods);